# Q1. What is data encoding? How is it useful in data science?
## In general, encoding is the process of converting data from one form to another. When working on some datasets, we found that some of the features are categorical, if we pass that feature directly to our model, our model can’t understand those feature variables. We all know that machines can’t understand categorical data. So, it is necessary to convert the categorical values of the features into numerical ones, so the machine can learn from those data and gives the right model. This process of converting categorical data into numerical data is called encoding.

## In data science, encoding is useful in many ways. It helps in converting categorical data into numerical data, which is easier to work with. It also helps in reducing the dimensionality of the data, which makes it easier to analyze. Moreover, it helps in improving the accuracy of the model by providing more information to the model

# Q2. What is nominal encoding? Provide an example of how you would use it in a real-world scenario.
## Nominal encoding is a type of encoding used when the categories of the categorical data do not have any particular order. For example, the city of a person lives in, gender of a person, marital status, etc. are nominal features.

## Nominal encoding is useful in many ways. It helps in converting categorical data into numerical data, which is easier to work with. It also helps in reducing the dimensionality of the data, which makes it easier to analyze. Moreover, it helps in improving the accuracy of the model by providing more information to the model.

## Here’s an example of how nominal encoding can be used in a real-world scenario. Suppose you are working on a dataset that contains information about the customers of a bank. One of the features in the dataset is the occupation of the customer. The occupation of the customer is a nominal feature because there is no particular order to the different occupations. To use this feature in your model, you can convert it into numerical data using nominal encoding.

# Q3. In what situations is nominal encoding preferred over one-hot encoding? Provide a practical example.
## Nominal encoding is preferred over one-hot encoding when the number of categories in the data is large. One-hot encoding creates a new column for each category, which can lead to a large number of columns in the dataset. This can make the dataset difficult to work with and can also lead to overfitting.

## For example, suppose you are working on a dataset that contains information about the customers of a bank. One of the features in the dataset is the occupation of the customer. The occupation of the customer is a nominal feature because there is no particular order to the different occupations. To use this feature in your model, you can convert it into numerical data using nominal encoding. This will create a new column for each category in the dataset.

# Q4. Suppose you have a dataset containing categorical data with 5 unique values. Which encoding technique would you use to transform this data into a format suitable for machine learning algorithms? Explain why you made this choice.

## One-hot encoding is the most common technique used for categorical data with 5 unique values. It creates a binary column for each unique value in the dataset and assigns a 1 to the column corresponding to the value for each data point, while assigning a 0 to all other columns.

### For example, suppose we have a categorical variable "color" with 5 unique values: red, blue, green, yellow, and black. One-hot encoding would transform the variable into 5 binary columns: "color_red," "color_blue," "color_green," "color_yellow," and "color_black." Each row in the dataset would have a 1 in the column corresponding to its color and 0s in all other columns.

## The advantage of one-hot encoding is that it preserves the information contained in the categorical variable and does not introduce any implicit ordering or hierarchy among the values. This is particularly important when working with nominal data, where there is no inherent ordering among the categories. One-hot encoding also works well with most machine learning algorithms, including linear models, tree-based models, and neural networks.

# Q5. In a machine learning project, you have a dataset with 1000 rows and 5 columns. Two of the columns are categorical, and the remaining three columns are numerical. If you were to use nominal encoding to transform the categorical data, how many new columns would be created? Show your calculations.
## If we use nominal encoding to transform the categorical data, we would create a new column for each unique value in each of the categorical columns.

## To determine the number of new columns that would be created, we need to first find the number of unique values in each of the categorical columns. Let's assume that column 1 and column 2 are the categorical columns in the dataset.
#### We can use the pandas library in Python to calculate the number of unique values in each categorical column:

In [17]:
import pandas as pd
df = pd.read_csv('dataset.csv')

In [28]:
df.head(10)

  column1 column2    column3    column4    column5
0       C   Green  11.814990  15.672434  15.744067
1       D    Blue  10.071789  21.041776  38.129142
2       A     Red  13.730006  20.535801  22.226099
3       C     Red  11.640965  25.983454  36.933247
4       C     Red  12.207428  21.359366  25.716548
5       D     Red  10.265132  25.790554   9.530653
6       A     Red  10.314723  15.309113  31.311901
7       A     Red  13.462641  20.709305  30.864285
8       C     Red   9.243414  14.426261  38.810716
9       B   Green  11.093559  20.488379  45.560006

### Counts the column1 unique values

In [21]:
n_unique_col1 = df['column1'].nunique()

In [19]:
n_unique_col1

4

### Counts the column2 unique values

In [22]:
n_unique_col2 = df['column2'].nunique()

In [23]:
n_unique_col2

3

### Total no of new columns created

In [24]:
new_columns = n_unique_col1 + n_unique_col2

In [26]:
new_columns

7

# Q6. You are working with a dataset containing information about different types of animals, including their species, habitat, and diet. Which encoding technique would you use to transform the categorical data into a format suitable for machine learning algorithms? Justify your answer.
## If I were working with a dataset containing information about different types of animals, including their species, habitat, and diet, I would use one-hot encoding to transform the categorical data into a format suitable for machine learning algorithms. One-hot encoding is used when the data is nominal and creates a new column for each category in the dataset. This technique is useful when the number of categories in the data is small.

## For example, suppose you are working on a dataset that contains information about different types of animals. One of the features in the dataset is the habitat of the animal. The habitat of the animal is a nominal feature because there is no particular order to the different habitats. To use this feature in your model, you can convert it into numerical data using one-hot encoding. This will create a new column for each habitat in the dataset.

# Q7.You are working on a project that involves predicting customer churn for a telecommunications company. You have a dataset with 5 features, including the customer's gender, age, contract type,monthly charges, and tenure. Which encoding technique(s) would you use to transform the categorical data into numerical data? Provide a step-by-step explanation of how you would implement the encoding.

## To transform the categorical data into numerical data, I would use a combination of nominal encoding and one-hot encoding. Here’s how I would implement the encoding:

## 1.Gender: Since gender is a binary feature, I would use nominal encoding to convert it into numerical data. I would assign a value of 0 to represent male and a value of 1 to represent female.

## 2.Age: Since age is a continuous feature, I would not need to encode it.

## 3.Contract type: Since contract type is a nominal feature, I would use one-hot encoding to convert it into numerical data. This would create a new column for each contract type in the dataset.

## 4.Monthly charges: Since monthly charges is a continuous feature, I would not need to encode it.

## 5.Tenure: Since tenure is a continuous feature, I would not need to encode it.
### Python script

In [75]:
import pandas as pd
df = pd.read_csv('customer_churn.csv')

In [76]:
df.head()

   gender  age   contract_type  monthly_charges  tenure
0    Male   30        One year        91.558394      20
1  Female   37        Two year        99.318027      34
2    Male   71  Month-to-month        24.921362      26
3    Male   24  Month-to-month        90.632502       5
4    Male   32  Month-to-month        61.286322      61

## Apply label encoding to gender

In [77]:
df['gender'] = df['gender'].map({'Male': 0, 'Female': 1})

In [78]:
df.head()

   gender  age   contract_type  monthly_charges  tenure
0       0   30        One year        91.558394      20
1       1   37        Two year        99.318027      34
2       0   71  Month-to-month        24.921362      26
3       0   24  Month-to-month        90.632502       5
4       0   32  Month-to-month        61.286322      61

## Apply one-hot encoding to contract type

In [79]:
contract_type_dummies = pd.get_dummies(df['contract_type'], prefix='contract_type')
df = pd.concat([df, contract_type_dummies], axis=1)

## Drop the original categorical variables

In [80]:
df.drop(['gender', 'contract_type'], axis=1, inplace=True)

In [81]:
df.head()

,age,monthly_charges,tenure,contract_type_Month-to-month,contract_type_One year,contract_type_Two year
0,30,91.558394,20,0,1,0
1,37,99.318027,34,0,0,1
2,71,24.921362,26,1,0,0
3,24,90.632502,5,1,0,0
4,32,61.286322,61,1,0,0